Revit 2023 API
TopographySurface Class
 Represents a TopographySurface element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public class TopographySurface : Element
Visual Basic
Public Class TopographySurface _
	Inherits Element
Visual C++
public ref class TopographySurface : public Element
Remarks
 A TopographySurface element in the Revit API represents:
An actual topography surface which can have an arbitrary boundary and collection of points.
A SiteSubRegion element bounded by a sketch.
A topography surface created automatically by the introduction of a BuildingPad element.
 Identify a subregion with the IsSiteSubRegion property, and access the object that provides interfaces to manipulate the subregion via AsSiteSubRegion(). Identify a topography surface associated with a building pad with the isAssociatedWithBuildingPad property, and access the associated BuildingPad element via the property AssociatedBuildingPadId. If the element does represent a subregion or a topography surface associated with a building pad, some methods of this class are inapplicable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.TopographySurface
See Also
TopographySurface Members
Autodesk.Revit.DB.Architecture Namespace